Revit 2027 API
ElectricalSetting.RemoveVoltageType Method
 Remove the voltage type from project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveVoltageType(
	VoltageType voltageType
)
Public Sub RemoveVoltageType (
	voltageType As VoltageType
)
public:
void RemoveVoltageType(
	VoltageType^ voltageType
)
member RemoveVoltageType :
        voltageType : VoltageType -> unit
Parameters
voltageType VoltageType
Specify the voltage type to be removed.
Exceptions
Exception | Condition
InvalidOperationException |  Voltage type can be removed only if it isn't in service with any distribution systems.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace